trade_exp/src/Documents/АктОРасхожденияхПослеПриемки/АктОРасхожденияхПослеПриемки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>АктОРасхожденияхПослеПриемки</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузкеПоНакладным</registerRecords>
  <attributes extendedConfigurationObject="8580f414-23ec-4bf4-a818-b951b6d29cf4">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c048ffc9-5f01-4528-a51f-2c6d84433c97">
    <name>СпособОтраженияРасхождений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd9ad9e6-1187-43a0-bae8-2ff473caa7a8">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b6e439a-f216-480b-b050-97d1c60d979e">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="19405493-cf59-4260-a5ee-9db3c7544236">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eaf3ced5-545f-4913-9498-8a3f2bae25f4">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c48d8351-30bf-4c54-aa37-fdc86d438996">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="273f1e0c-dcaa-44f9-9347-3a3f38c28d42">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ef12b57c-5192-46c2-9af9-69d2b5697a75">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="90aeac46-62e8-4627-8584-6b9c991a4a1e">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5df37e85-9639-4cf3-a816-c43c612e07d6">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="697dd590-7cd3-48c5-9461-d66c7fc23543">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cdb7147e-b6cc-47a0-a515-bcec79a56c33">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6becfe9-163a-40ca-85a3-ca2db6c2b145">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="faed32f1-9953-4fce-b714-7e64b332f3a7">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="14e5c170-22c3-4b84-8fca-12aeeaaba46a">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c99935f5-a246-421c-ab3e-6724ca9a55b7">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="14571ad4-2285-4849-bddb-b7326d437325">
    <name>ДатаОтработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="46d08459-6e8f-4dd1-afa6-48b0b18e6737">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сделка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bf76dec0-044d-4c82-a050-95c06a8c6b2c">
      <name>СуммаНДСПоДокументу</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a2073b4e-c2d0-46df-b725-045ef72b0a1e">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b02c8351-7f9a-4c22-b173-446ca42e21c5">
      <name>Сертификат</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5ebab651-cf23-46cb-a0d5-d0f4e4c4f3ee">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6db7b8f5-5384-4d74-a396-6b03da43029d">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e72d2458-ca63-4f0b-bec1-fa8ca7db1d24">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9fff9fd8-9729-4018-9e38-6940b3cf61c0">
      <name>СуммаПоДокументу</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a8d6527c-a168-452f-9adc-5523a86b160c">
      <name>СуммаСНДСПоДокументу</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2bc6b245-2229-4621-b00a-f722c05aa15f">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d8a2896c-9b5e-42c7-b98d-f29c8340b8d6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="645cf1a4-8cc9-4770-87a8-65b09bda9adc">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="323d1424-9104-44a8-9fb4-ebd770bac325">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3f980b12-92dc-4e55-9102-ea268b930e5b">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="41601312-f3c7-4994-8e9c-da327ec774ea">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f4cdd563-e97e-49f0-9177-ac688727d2ce">
      <name>ВидЦеныПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d15a3390-bde4-4cd3-9420-855f29c66bd6">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa085ec2-9ab6-4537-8206-e76e6ece63b6">
      <name>КоличествоУпаковокПоДокументу</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cc21927e-600d-4eb1-a13a-74c0e29be52c">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0645f30f-e01e-40ee-9a60-52cea6a96051">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2b7564dd-225d-4a78-9478-f58101057823">
      <name>НомерПаспорта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>25</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="26fef6dd-ab8c-45a0-8767-4cffc2f30df1">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c6cd3821-744e-48ce-8fd4-abbfacb7831c">
      <name>ЗаказПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="27d4cdd6-35d2-4521-8d0e-baad7d2b296e">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b0a6706a-f06d-4892-9fd9-ee66cd41c89e">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="73220672-95e9-43ab-8220-2cd1f7a61799">
      <name>СписатьНаРасходы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6ade236d-6903-4cab-b1f3-401289971118">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5a531d31-dbf4-4819-9184-27a5f3b4caff">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c8b8abb4-d295-4164-9cde-ea50592f454b">
      <name>ДокументРеализации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="839cfdde-26fe-479e-bc72-fbcbce7bb1cb">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="545d442b-8b05-43b2-b89f-083e21986b47">
      <name>НоменклатураПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0a697d78-68ce-49b4-a7e3-d62118628c27">
      <name>КомментарийМенеджера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="286314ea-6aa9-43ac-b8d6-ecd00f14e246">
      <name>КомментарийПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/СтатусыАктаОРасхождениях/СтатусыАктаОРасхождениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыАктаОРасхождениях</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеСогласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Претензия</name>
  </enumValues>
  <enumValues>
    <name>Отработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/АктОРасхожденияхПослеПриемки/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.ИсключитьИзКонтроля.Доступность= РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");
	
	Если Объект.Статус = Перечисления.СтатусыАктаОРасхождениях.Отработано и Объект.Проведен Тогда
		Если  АльтерраОбщегоНазначения._РольДоступна("ПравкаОтработанныхАктов") или РольДоступна("ПолныеПрава") Тогда
			Элементы.ГруппаСтраницы.ТолькоПросмотр = Истина;
			Элементы.ГруппаТоварыЗаполнить.Доступность = Ложь;
			Элементы.ТоварыРазбитьСтроку.Доступность = Ложь;
			Элементы.ТоварыИзменитьДействие.Доступность = Ложь;
			Элементы.ТоварыДействие.Доступность = Ложь;
		Иначе
			ЭтаФорма.ТолькоПросмотр = Истина;
			Элементы.ТоварыДействие.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Док_ОбновитьЦенуПосле(Команда)
	ОбновитьЦенуПоОснованиям();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЦенуПоОснованиям()
	
	Если ДокументыОснования.Количество() <> 0 Тогда
		
		Запрос = Новый Запрос;
		
		Если Объект.ТипОснованияАктаОРасхождении = Перечисления.ТипыОснованияАктаОРасхождении.ВозвратТоваровОтКлиента Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ВозвратТоваровОтКлиентаТовары.Порча
				|			ТОГДА ВозвратТоваровОтКлиентаТовары.НоменклатураОприходование
				|		ИНАЧЕ ВозвратТоваровОтКлиентаТовары.Номенклатура
				|	КОНЕЦ КАК Номенклатура,
				|	ВЫБОР
				|		КОГДА ВозвратТоваровОтКлиентаТовары.Порча
				|			ТОГДА ВозвратТоваровОтКлиентаТовары.ХарактеристикаОприходование
				|		ИНАЧЕ ВозвратТоваровОтКлиентаТовары.Характеристика
				|	КОНЕЦ КАК Характеристика,
				|	ВозвратТоваровОтКлиентаТовары.Упаковка КАК Упаковка,
				|	ВозвратТоваровОтКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковокПоДокументу,
				|	ВозвратТоваровОтКлиентаТовары.Сумма КАК СуммаПоДокументу,
				|	ВозвратТоваровОтКлиентаТовары.СуммаСНДС КАК СуммаСНДСПоДокументу,
				|	ВозвратТоваровОтКлиентаТовары.СуммаНДС КАК СуммаНДСПоДокументу,
				|	ВозвратТоваровОтКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
				|	ВозвратТоваровОтКлиентаТовары.Цена КАК Цена
				|ИЗ
				|	Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
				|ГДЕ
				|	ВозвратТоваровОтКлиентаТовары.Ссылка В(&ДокументыОснования)";

		ИначеЕсли Объект.ТипОснованияАктаОРасхождении = Перечисления.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг Тогда
			Запрос.Текст = 		
				"ВЫБРАТЬ
				|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
				|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
				|	ПриобретениеТоваровУслугТовары.Упаковка КАК Упаковка,
				|	ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковокПоДокументу,
				|	ВЫБОР
				|		КОГДА ПриобретениеТоваровУслугТовары.КоличествоУпаковок = 0
				|			ТОГДА ПриобретениеТоваровУслугТовары.Цена
				|		ИНАЧЕ ВЫРАЗИТЬ(ПриобретениеТоваровУслугТовары.Сумма / ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК ЧИСЛО(31, 2))
				|	КОНЕЦ КАК Цена,
				|	ПриобретениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
				|	ПриобретениеТоваровУслугТовары.Сумма КАК СуммаПоДокументу,
				|	ПриобретениеТоваровУслугТовары.СуммаНДС КАК СуммаНДСПоДокументу,
				|	ПриобретениеТоваровУслугТовары.СуммаСНДС КАК СуммаСНДСПоДокументу
				|ИЗ
				|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
				|ГДЕ
				|	ПриобретениеТоваровУслугТовары.Ссылка В(&ДокументыОснования)";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДокументыОснования", ДокументыОснования.Выгрузить().ВыгрузитьКолонку("Реализация"));
		СтрТабл = Запрос.Выполнить().Выбрать();
		
		СтруктураПоиска = Новый Структура("Номенклатура,Характеристика,Упаковка");
		ТоварыДокумента = Объект.Товары;
		
		Пока СтрТабл.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрТабл);
			НайденныеСтрокиДокумента = ТоварыДокумента.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтрокиДокумента.Количество() > 0 Тогда
				Для Каждого СтрТЧ Из НайденныеСтрокиДокумента Цикл
					СтрТЧ.Цена = СтрТабл.Цена;
					СтрТЧ.СтавкаНДС = СтрТабл.СтавкаНДС;
					
					Если ЗначениеЗаполнено(СтрТЧ.Упаковка) Тогда;
						РеквизитыУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентВесОбъемПрочиеРеквизитыУпаковки(СтрТЧ.Упаковка, СтрТЧ.Номенклатура); 
					Иначе
						РеквизитыУпаковки = Новый Структура("Коэффициент", 1);
					КонецЕсли;						
					
					СтрТЧ.КоличествоУпаковокПоДокументу = СтрТабл.КоличествоУпаковокПоДокументу;
					СтрТЧ.КоличествоПоДокументу = СтрТЧ.КоличествоУпаковокПоДокументу * РеквизитыУпаковки.Коэффициент;		
					СтрТЧ.СуммаПоДокументу = СтрТабл.СуммаПоДокументу;
					СтрТЧ.СуммаСНДСПоДокументу = СтрТабл.СуммаСНДСПоДокументу;
					СтрТЧ.СуммаНДСПоДокументу = СтрТабл.СуммаНДСПоДокументу;
										
					СтрТЧ.КоличествоУпаковок = СтрТЧ.КоличествоУпаковокПоДокументу + СтрТЧ.КоличествоУпаковокРасхождения;
					СтрТЧ.Количество = СтрТЧ.КоличествоУпаковок * РеквизитыУпаковки.Коэффициент;
					СтрТЧ.Сумма = СтрТЧ.СуммаПоДокументу + СтрТЧ.СуммаРасхождения;
					СтрТЧ.СуммаСНДС = СтрТЧ.СуммаСНДСПоДокументу + СтрТЧ.СуммаСНДСРасхождения;	
					СтрТЧ.СуммаНДС = СтрТЧ.СуммаНДСПоДокументу + СтрТЧ.СуммаНДСРасхождения;						
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;	
		
		РасхожденияКлиентСервер.РассчитатьИтоговыеПоказателиФормы(ЭтаФорма);
		ЭтаФорма.Модифицированность = Истина;   
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&Вместо("ЗаполнитьПоПриемкеСервер")
Функция Док_ЗаполнитьПоПриемкеСервер()

	ТекстРазделителя = НакладныеСервер.ТекстРазделителяЗапросов();
	
	ПараметрыЗаполнения = Документы.АктОРасхожденияхПослеПриемки.ПараметрыЗаполненияДокумента();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОрдернаяСхемаПриПриемке = ОрдернаяСхемаПриПриемке();
	
	УстановитьПривилегированныйРежим(Ложь);

	ТаблицаНакладная = Объект.Товары.Выгрузить();
	ТаблицаНакладная.Колонки.Добавить("КоличествоМаксимум", Новый ОписаниеТипов("Число"));
	ТаблицаНакладная.Колонки.Добавить("КоличествоВЗаказе", Новый ОписаниеТипов("Число"));
	ТаблицаНакладная.Колонки.Добавить("КоличествоВОрдере", Новый ОписаниеТипов("Число"));
	ТаблицаНакладная.Колонки.Добавить("Распоряжение");

	Для каждого СтрокаТовары Из ТаблицаНакладная Цикл
		СтрокаТовары.КоличествоМаксимум = Макс(СтрокаТовары.Количество, СтрокаТовары.КоличествоПоДокументу);
		Если ЗначениеЗаполнено(СтрокаТовары.ЗаказПоставщику) Тогда
			СтрокаТовары.Распоряжение = СтрокаТовары.ЗаказПоставщику;
		Иначе
			СтрокаТовары.Распоряжение = СтрокаТовары.ДокументОснование;
		КонецЕсли;		
	КонецЦикла;

	МассивЗаказов = ТаблицаНакладная.ВыгрузитьКолонку("Распоряжение");
	МассивЗаказов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗаказов);
	
	РаспоряженияДляОрдеров = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МассивЗаказов);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РаспоряженияДляОрдеров, ТаблицаНакладная.ВыгрузитьКолонку("ДокументОснование"));
	
	ИсключаемыеНакладные = ТаблицаНакладная.ВыгрузитьКолонку("ДокументОснование");
	ИсключаемыеНакладные = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИсключаемыеНакладные);

	// Заказы

	ТекстОбъединитьВсе = 
	"
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|";
	
	Отбор = Новый Структура();
	Отбор.Вставить("Ссылка", "Распоряжения");
	
	Если Объект.ТипОснованияАктаОРасхождении = Перечисления.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг
		Тогда

	ТекстЗапросаЗаказ = Документы.ЗаказПоставщику.ТекстЗапросаТоварыДокумента(Отбор);
		
		Отбор = Новый Структура();
		Отбор.Вставить("ЗаказПоставщику", "Распоряжения");
		
		ТекстЗапросаРегистраЗаказы = РегистрыНакопления.ЗаказыПоставщикам.ТекстЗапросаОстатки(
			"ВтДанныеУчета",
			Отбор,
			"КОформлению <> 0");

	Иначе

		ТекстЗапросаЗаказ = Документы.ЗаявкаНаВозвратТоваровОтКлиента.ТекстЗапросаТоварыДокумента(Отбор);
		
		Отбор = Новый Структура();
		Отбор.Вставить("ЗаявкаНаВозвратТоваровОтКлиента", "Распоряжения");
		
		ТекстЗапросаРегистраЗаказы = РегистрыНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.ТекстЗапросаОстатки(
			"ВтДанныеУчета",
			Отбор,
			"КОформлению <> 0");
			
	КонецЕсли;

	ТекстЗапроса = ТекстЗапросаРегистраЗаказы
					+ ТекстРазделителя
					+ ТекстЗапросаЗаказ;
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Распоряжения", МассивЗаказов);
	Запрос.УстановитьПараметр("Регистратор",  ИсключаемыеНакладные);
	
	ТаблицаЗаказы = Запрос.Выполнить().Выгрузить();
	ТаблицаЗаказы.Колонки.КОформлению.Имя = "КоличествоВЗаказе";
	ТаблицаЗаказы.Колонки.ЗаказПоставщику.Имя = "Заказ";
	
	// Ордера
	Запрос = Новый Запрос();
	
	Запрос.Текст = ТекстЗапросаОсталосьОформить();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.Текст = Запрос.Текст + " И Таблица.Регистратор <> &ЭтотДокумент";
		Запрос.УстановитьПараметр("ЭтотДокумент", Объект.Ссылка);
	КонецЕсли;
	Запрос.УстановитьПараметр("Распоряжения", РаспоряженияДляОрдеров);
	Запрос.УстановитьПараметр("Регистратор",  ИсключаемыеНакладные);
	
	ТаблицаОрдера = Объект.Товары.Выгрузить(Новый Массив()).СкопироватьКолонки();
	
	ТипыРаспоряжений = Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику, ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента, 
		|ДокументСсылка.ВозвратТоваровОтКлиента, ДокументСсылка.ПриобретениеТоваровУслуг");

	ТаблицаОрдера.Колонки.Добавить("Распоряжение", ТипыРаспоряжений);
    
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), ТаблицаОрдера);
	
	ТаблицаОрдера = ДополнитьТаблицуСпособомСоединения(ТаблицаОрдера, ПараметрыУказанияСерий, ОрдернаяСхемаПриПриемке);

	ТаблицаОрдера.Колонки.Количество.Имя = "КоличествоВОрдере";
	
	// Распределение полученных таблиц
	ТаблицаЗаказы.Колонки.Заказ.Имя = "Распоряжение";

	ТаблицаНакладная.Индексы.Добавить(ПараметрыЗаполнения.КлючевыеПоля);
	
	Ключ = "Распоряжение, КодСтроки";

	Условие = "ПО [КоличествоМаксимум]";
	НакладныеСервер.РаспределитьКоличество(ТаблицаЗаказы, ТаблицаНакладная, "КоличествоВЗаказе", Ключ, Условие, Истина);
	
	// Добавление отдельными строками нераспределенного количества заказов
	НакладныеСервер.ДополнитьТаблицу(ТаблицаЗаказы, ТаблицаНакладная, "КоличествоВЗаказе");
		
	ТаблицаНакладная = ДополнитьТаблицуСпособомСоединения(ТаблицаНакладная, ПараметрыУказанияСерий, ОрдернаяСхемаПриПриемке);

	// Добавление количества ордеров.
	
	// Разделение таблиц ТаблицаНакладная и ТаблицаПолученоОстаток на несколько по полю "СпособСоединения".
	ТаблицыНакладных = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(ТаблицаНакладная, "СпособСоединения");
	ТаблицыПолученных = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(ТаблицаОрдера, "СпособСоединения");
	
	// Формирование структуры действий с разделенными таблицами
	ДействияСПолученнымиТаблицами = Новый Структура();

	Для Каждого КлючЗначение Из ТаблицыНакладных Цикл
		
		Ключ = КлючЗначение.Ключ.СпособСоединения;
		СтруктураДействий = Новый Структура("ТаблицаНакладная, ТаблицаПолученоОстаток", КлючЗначение.Таблица, ТаблицаОрдера.СкопироватьКолонки());
		ДействияСПолученнымиТаблицами.Вставить(Ключ, СтруктураДействий);
		
	КонецЦикла;
	
	Для Каждого КлючЗначение Из ТаблицыПолученных Цикл

		Ключ = КлючЗначение.Ключ.СпособСоединения;
		
		Если ДействияСПолученнымиТаблицами.Свойство(Ключ) Тогда
			СтруктураДействий = ДействияСПолученнымиТаблицами[Ключ];
			СтруктураДействий.ТаблицаПолученоОстаток = КлючЗначение.Таблица;
		Иначе
			СтруктураДействий = Новый Структура("ТаблицаНакладная, ТаблицаПолученоОстаток", ТаблицаНакладная.СкопироватьКолонки(), КлючЗначение.Таблица);
			ДействияСПолученнымиТаблицами.Вставить(Ключ, СтруктураДействий);
		КонецЕсли;

	КонецЦикла;

	РезультирующаяТаблица      = ТаблицаНакладная.СкопироватьКолонки();
	РезультирующаяТаблицаСерии = ТаблицаНакладная.СкопироватьКолонки();
		
	НакладнаяЯвляетсяРаспоряжением = ЗакупкиСервер.РаспоряжениеНаПриемкуТовараНакладная(Объект.ВариантПриемкиТоваров);
	
	Для Каждого КлючЗначение Из ДействияСПолученнымиТаблицами Цикл
		
		Действие = КлючЗначение.Ключ;
		СтруктураДействий = КлючЗначение.Значение;
		
		ТаблицаНакладнойПоДействию = СтруктураДействий.ТаблицаНакладная;
		ТаблицаОрдераПоДействию    = СтруктураДействий.ТаблицаПолученоОстаток;
				
		Если НакладнаяЯвляетсяРаспоряжением Тогда
			Ключ = "Номенклатура, Характеристика, Серия, Назначение";
		Иначе
			Ключ = "Распоряжение, Номенклатура, Характеристика, Серия, Назначение";
		КонецЕсли;

		Если Действие = "А0" Или Действие = "А3" Тогда
			Ключ = СтрЗаменить(Ключ, ", Серия", "")
		КонецЕсли;
		
			// Есть накладные и заказы
				Условие = "[КоличествоМаксимум], [КоличествоВЗаказе], ПО [КоличествоВЗаказе]";
				НакладныеСервер.РаспределитьКоличество(ТаблицаОрдераПоДействию, ТаблицаНакладнойПоДействию, "КоличествоВОрдере", Ключ, Условие, Ложь);
				
				// Есть заказы, нет накладных
				Условие = "НЕ [КоличествоМаксимум], [КоличествоВЗаказе], ПО [КоличествоВЗаказе]";
				НакладныеСервер.РаспределитьКоличество(ТаблицаОрдераПоДействию, ТаблицаНакладнойПоДействию, "КоличествоВОрдере", Ключ, Условие, Ложь);
				
				// Есть накладные, нет заказов
				Условие = "[КоличествоМаксимум], НЕ [КоличествоВЗаказе], ПО [КоличествоМаксимум]";
				НакладныеСервер.РаспределитьКоличество(ТаблицаОрдераПоДействию, ТаблицаНакладнойПоДействию, "КоличествоВОрдере", Ключ, Условие, Истина);

		// Добавление отдельными строками нераспределенного количества ордеров
		НакладныеСервер.ДополнитьТаблицу(ТаблицаОрдераПоДействию, ТаблицаНакладнойПоДействию, "КоличествоВОрдере");

		// Отнесение новых строк на заказы и документы основания

		ПараметрыОтбора = Новый Структура("ЗаказПоставщику", Документы.ЗаказПоставщику.ПустаяСсылка());
		СтрокиСПустымЗаказом = ТаблицаНакладнойПоДействию.НайтиСтроки(ПараметрыОтбора);

		Для Каждого Строка Из СтрокиСПустымЗаказом Цикл
			Если ТипЗнч(Строка.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Строка.ЗаказПоставщику = Строка.Распоряжение;
				ПараметрыОтбора.ЗаказПоставщику = Строка.Распоряжение;
				СтрокиСДокументомОснованием = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
								
				Если СтрокиСДокументомОснованием.Количество() > 0 Тогда
					Строка.ДокументОснование = СтрокиСДокументомОснованием[0].ДокументОснование;
				КонецЕсли;
			Иначе
				Строка.ДокументОснование = Строка.Распоряжение;
			КонецЕсли;
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаНакладнойПоДействию, РезультирующаяТаблица);

	КонецЦикла;
		
	РезультирующаяТаблица.Колонки.Количество.Имя             = "КоличествоДоИзменения";
	РезультирующаяТаблица.Колонки.КоличествоВОрдере.Имя      = "Количество";
	
	РезультирующаяТаблицаСерии.Колонки.Количество.Имя        = "КоличествоДоИзменения";
	РезультирующаяТаблицаСерии.Колонки.КоличествоВОрдере.Имя = "Количество";

	// Удаление пустых строк
	СтрокиНеПоДокументу = РезультирующаяТаблица.НайтиСтроки(Новый Структура("КоличествоПоДокументу", 0));
	Для каждого Строка Из СтрокиНеПоДокументу Цикл
		Если Строка.Количество = 0 Тогда
			РезультирующаяТаблица.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Объект.Товары.Загрузить(РезультирующаяТаблица);
	Объект.Серии.Загрузить(РезультирующаяТаблицаСерии);
	
	// Обновление статусов указания серий.
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(Объект, ПараметрыУказанияСерий);
	Документы.АктОРасхожденияхПослеПриемки.ОбновитьЗависимыеРеквизитыПослеЗаполненияФактаПоПриемке(Объект);
	
	РасхожденияСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(Объект);
	ЗакупкиСервер.ЗаполнитьСлужебныеРеквизитыНомераГТД(Объект.Товары);
	
	УчетНДСНеВедется = РасхожденияКлиентСервер.УчетНДСНеВедется(Объект.ТипОснованияАктаОРасхождении);

	ДанныеСтрокиДоИзменения = Неопределено;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаТовары.ДокументОснование) Тогда
			СамообслуживаниеКлиентСервер.ЗаполнитьДокументОснованиеВСтроке(СтрокаТовары, ДокументыОснования, Ложь);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовары.ВидЦеныПоставщика) Тогда
			
			Если ДанныеСтрокиДоИзменения = Неопределено Тогда
				ДанныеСтрокиДоИзменения = СформироватьСтруктуруДляДанныхСтрокиДоИзменения();
			КонецЕсли; 

			ЗаполнитьЗначенияСвойств(ДанныеСтрокиДоИзменения, СтрокаТовары);
			
			// попытка заполнения видов цен по документам основания и рассчета сумм
			Если Объект.ТипОснованияАктаОРасхождении = ПредопределенноеЗначение("Перечисление.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг")

				Тогда
				
				Если ИспользоватьСоглашенияСПоставщиками И ЗначениеЗаполнено(Объект.Соглашение) Тогда
					СтруктураДействий.Вставить("ЗаполнитьУсловияЗакупок", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект));
				Иначе
					СтруктураДействий.Вставить("ЗаполнитьЦенуЗакупки", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект));
				КонецЕсли;
				
				СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПартнераПоНоменклатуре", Объект.Партнер);
				
			КонецЕсли;
			
			Если Не УчетНДСНеВедется Тогда
				
				СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
				ПараметрыЗаполнитьСтавкуНДС = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект);
				
				СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПараметрыЗаполнитьСтавкуНДС);
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				
			КонецЕсли;

			СтруктураДействий.Вставить("ПересчитатьСумму");
			СтруктураДействий.Вставить("ПересчитатьРасхожденияПослеПриемки");

			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТовары, СтруктураДействий, Неопределено);
			
			Если СтрокаТовары.Цена = 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТовары, ДанныеСтрокиДоИзменения);				
			КонецЕсли; 
			
	КонецЕсли;
		
	КонецЦикла;

	Если Объект.ТипОснованияАктаОРасхождении = Перечисления.ТипыОснованияАктаОРасхождении.ПриобретениеТоваровУслуг Тогда
 		
		ЗаполнитьРеквизитыМногооборотнойТары();
		
	КонецЕсли;

	// Постобработка индивидуальная для документа
	РасхожденияКлиентСервер.РассчитатьИтоговыеПоказателиФормы(ЭтаФорма);

	Возврат Истина;
	
КонецФункции
#КонецОбласти

Функция ТекстЗапросаОсталосьОформить()
Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
        |	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
        |	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
        |	ПриобретениеТоваровУслугТовары.Назначение КАК Назначение,
        |	ПриобретениеТоваровУслугТовары.Склад КАК Склад,
        |	ЕСТЬNULL(АктОРасхожденияхПослеПриемкиТовары.Количество, ПриобретениеТоваровУслугТовары.Количество) КАК Количество
        |ПОМЕСТИТЬ втТоварыДругогоПриобретения
        |ИЗ
        |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
        |		ПО ЗаказПоставщикуТовары.Ссылка = ПриобретениеТоваровУслуг.ЗаказПоставщику
        |			И (ПриобретениеТоваровУслуг.Проведен)
        |			И (НЕ ПриобретениеТоваровУслуг.Ссылка В (&Регистратор))
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
        |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
        |			ПО (АктОРасхожденияхПослеПриемкиТовары.ДокументОснование = ПриобретениеТоваровУслугТовары.Ссылка)
        |				И (АктОРасхожденияхПослеПриемкиТовары.Ссылка.Проведен)
        |				И (АктОРасхожденияхПослеПриемкиТовары.Номенклатура = ПриобретениеТоваровУслугТовары.Номенклатура)
        |				И (АктОРасхожденияхПослеПриемкиТовары.Характеристика = ПриобретениеТоваровУслугТовары.Характеристика)
        |		ПО (ПриобретениеТоваровУслуг.Ссылка = ПриобретениеТоваровУслугТовары.Ссылка)
        |			И ЗаказПоставщикуТовары.Номенклатура = ПриобретениеТоваровУслугТовары.Номенклатура
        |			И ЗаказПоставщикуТовары.Характеристика = ПриобретениеТоваровУслугТовары.Характеристика
        |			И ЗаказПоставщикуТовары.Назначение = ПриобретениеТоваровУслугТовары.Назначение
        |			И ЗаказПоставщикуТовары.Склад = ПриобретениеТоваровУслугТовары.Склад
        |ГДЕ
        |	ЗаказПоставщикуТовары.Ссылка ССЫЛКА Документ.ЗаказПоставщику
        |	И ЗаказПоставщикуТовары.Ссылка В(&Распоряжения)
        |
        |СГРУППИРОВАТЬ ПО
        |	ПриобретениеТоваровУслугТовары.Номенклатура,
        |	ПриобретениеТоваровУслугТовары.Характеристика,
        |	ПриобретениеТоваровУслугТовары.Назначение,
        |	ПриобретениеТоваровУслугТовары.Склад,
        |	ЕСТЬNULL(АктОРасхожденияхПослеПриемкиТовары.Количество, ПриобретениеТоваровУслугТовары.Количество)
        |
        |ОБЪЕДИНИТЬ
        |
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |	АктОРасхожденияхПослеПриемкиТовары.Номенклатура,
        |	АктОРасхожденияхПослеПриемкиТовары.Характеристика,
        |	АктОРасхожденияхПослеПриемкиТовары.Назначение,
        |	АктОРасхожденияхПослеПриемкиТовары.Склад,
        |	АктОРасхожденияхПослеПриемкиТовары.Количество
        |ИЗ
        |	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
        |		ПО АктОРасхожденияхПослеПриемкиТовары.Ссылка = АктОРасхожденияхПослеПриемки.Ссылка
        |			И (АктОРасхожденияхПослеПриемки.Проведен)
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
        |		ПО АктОРасхожденияхПослеПриемкиТовары.ЗаказПоставщику = ДокЗаказПоставщику.Ссылка
        |			И (НЕ АктОРасхожденияхПослеПриемкиТовары.ДокументОснование В (&Регистратор))
        |ГДЕ
        |	ДокЗаказПоставщику.Ссылка ССЫЛКА Документ.ЗаказПоставщику
        |	И ДокЗаказПоставщику.Ссылка В(&Распоряжения)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	Таблица.ДокументПоступления КАК Распоряжение,
        |	Таблица.Номенклатура КАК Номенклатура,
        |	Таблица.Характеристика КАК Характеристика,
        |	Таблица.Назначение КАК Назначение,
        |	Таблица.Склад КАК Склад,
        |	Таблица.Серия КАК Серия,
        |	Таблица.КОформлениюПоступленийПоОрдерамПриход - ЕСТЬNULL(втТоварыДругогоПриобретения.Количество, 0) КАК Количество
        |ИЗ
        |	РегистрНакопления.ТоварыКПоступлению.Обороты(, , Регистратор, ДокументПоступления В (&Распоряжения)) КАК Таблица
        |		ЛЕВОЕ СОЕДИНЕНИЕ втТоварыДругогоПриобретения КАК втТоварыДругогоПриобретения
        |		ПО Таблица.Номенклатура = втТоварыДругогоПриобретения.Номенклатура
        |			И Таблица.Характеристика = втТоварыДругогоПриобретения.Характеристика
        |			И Таблица.Назначение = втТоварыДругогоПриобретения.Назначение
        |			И Таблица.Склад = втТоварыДругогоПриобретения.Склад
        |ГДЕ
        |	(Таблица.КОформлениюПоступленийПоОрдерамПриход <> втТоварыДругогоПриобретения.Количество
        |			ИЛИ втТоварыДругогоПриобретения.Номенклатура ЕСТЬ NULL)";	
КонецФункции
